; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
;; Reference paper: Scala, Enrico, Patrik Haslum, Sylvie Thiébaux, and Miquel Ramirez. 
;;                  "Subgoaling techniques for satisficing and optimal numeric planning." 
;;                  Journal of Artificial Intelligence Research 68 (2020): 691-752.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; The Farmland domain models allocating manpower to farms, with a 
;; hard constraint on a metric measuring benefit. The contribution of
;; each farm to the benefit is a function of the number of workers assigned
;; Each farm requires at least one worker
(define (domain farmland)
    (:types farm - object)
    (:predicates (adj ?f1 ?f2 - farm))
    (:functions
        (x ?b - farm)
        (cost)
    )

    ;; Move a person from a unit f1 to a unit f2
    (:action move-fast
        :parameters (?f1 ?f2 - farm)
       :precondition (and (not (= ?f1 ?f2)) (>= (x ?f1) 4) (adj ?f1 ?f2) )
      :effect (and(decrease (x ?f1) 4) (increase (x ?f2) 2) (increase (cost) 1))
    )
    
    (:action move-slow
         :parameters (?f1 ?f2 - farm)
         :precondition (and (not (= ?f1 ?f2)) (>= (x ?f1) 1) (adj ?f1 ?f2))
         :effect (and(decrease (x ?f1) 1) (increase (x ?f2) 1))
    )

)

; problem
(define (problem instance_2_300_1229_ladder)
	(:domain farmland)
	(:objects
		farm0 farm1 - farm
	)
	(:init
		(= (cost) 0.0)
		(adj farm1 farm0)
		(= (x farm0) 300.0)
		(adj farm0 farm1)
		(= (x farm1) 1.0)
	)
	(:goal
			(and
				(>= (x farm0) 1.0)
				(>= (x farm1) 1.0)
				(>= (+ (* 1.0 (x farm0)) (+ (* 1.7 (x farm1)) 0.0)) 420.0)
			)
	)
)

; plan
1. (move-slow farm0 farm1)
   changed: (x farm0) from 300 to 299, (x farm1) from 1 to 2
   goals met: 2 of 3
2. (move-slow farm0 farm1)
   changed: (x farm0) from 299 to 298, (x farm1) from 2 to 3
   goals met: 2 of 3
3. (move-slow farm0 farm1)
   changed: (x farm0) from 298 to 297, (x farm1) from 3 to 4
   goals met: 2 of 3
4. (move-slow farm0 farm1)
   changed: (x farm0) from 297 to 296, (x farm1) from 4 to 5
   goals met: 2 of 3
5. (move-slow farm0 farm1)
   changed: (x farm0) from 296 to 295, (x farm1) from 5 to 6
   goals met: 2 of 3
6. (move-slow farm0 farm1)
   changed: (x farm0) from 295 to 294, (x farm1) from 6 to 7
   goals met: 2 of 3
7. (move-slow farm0 farm1)
   changed: (x farm0) from 294 to 293, (x farm1) from 7 to 8
   goals met: 2 of 3
8. (move-slow farm0 farm1)
   changed: (x farm0) from 293 to 292, (x farm1) from 8 to 9
   goals met: 2 of 3
9. (move-slow farm0 farm1)
   changed: (x farm0) from 292 to 291, (x farm1) from 9 to 10
   goals met: 2 of 3
10. (move-slow farm0 farm1)
   changed: (x farm0) from 291 to 290, (x farm1) from 10 to 11
   goals met: 2 of 3
11. (move-slow farm0 farm1)
   changed: (x farm0) from 290 to 289, (x farm1) from 11 to 12
   goals met: 2 of 3
12. (move-slow farm0 farm1)
   changed: (x farm0) from 289 to 288, (x farm1) from 12 to 13
   goals met: 2 of 3
13. (move-slow farm0 farm1)
   changed: (x farm0) from 288 to 287, (x farm1) from 13 to 14
   goals met: 2 of 3
14. (move-slow farm0 farm1)
   changed: (x farm0) from 287 to 286, (x farm1) from 14 to 15
   goals met: 2 of 3
15. (move-slow farm0 farm1)
   changed: (x farm0) from 286 to 285, (x farm1) from 15 to 16
   goals met: 2 of 3
16. (move-slow farm0 farm1)
   changed: (x farm0) from 285 to 284, (x farm1) from 16 to 17
   goals met: 2 of 3
17. (move-slow farm0 farm1)
   changed: (x farm0) from 284 to 283, (x farm1) from 17 to 18
   goals met: 2 of 3
18. (move-slow farm0 farm1)
   changed: (x farm0) from 283 to 282, (x farm1) from 18 to 19
   goals met: 2 of 3
19. (move-slow farm0 farm1)
   changed: (x farm0) from 282 to 281, (x farm1) from 19 to 20
   goals met: 2 of 3
20. (move-slow farm0 farm1)
   changed: (x farm0) from 281 to 280, (x farm1) from 20 to 21
   goals met: 2 of 3
21. (move-slow farm0 farm1)
   changed: (x farm0) from 280 to 279, (x farm1) from 21 to 22
   goals met: 2 of 3
22. (move-slow farm0 farm1)
   changed: (x farm0) from 279 to 278, (x farm1) from 22 to 23
   goals met: 2 of 3
23. (move-slow farm0 farm1)
   changed: (x farm0) from 278 to 277, (x farm1) from 23 to 24
   goals met: 2 of 3
24. (move-slow farm0 farm1)
   changed: (x farm0) from 277 to 276, (x farm1) from 24 to 25
   goals met: 2 of 3
25. (move-slow farm0 farm1)
   changed: (x farm0) from 276 to 275, (x farm1) from 25 to 26
   goals met: 2 of 3
26. (move-slow farm0 farm1)
   changed: (x farm0) from 275 to 274, (x farm1) from 26 to 27
   goals met: 2 of 3
27. (move-slow farm0 farm1)
   changed: (x farm0) from 274 to 273, (x farm1) from 27 to 28
   goals met: 2 of 3
28. (move-slow farm0 farm1)
   changed: (x farm0) from 273 to 272, (x farm1) from 28 to 29
   goals met: 2 of 3
29. (move-slow farm0 farm1)
   changed: (x farm0) from 272 to 271, (x farm1) from 29 to 30
   goals met: 2 of 3
30. (move-slow farm0 farm1)
   changed: (x farm0) from 271 to 270, (x farm1) from 30 to 31
   goals met: 2 of 3
31. (move-slow farm0 farm1)
   changed: (x farm0) from 270 to 269, (x farm1) from 31 to 32
   goals met: 2 of 3
32. (move-slow farm0 farm1)
   changed: (x farm0) from 269 to 268, (x farm1) from 32 to 33
   goals met: 2 of 3
33. (move-slow farm0 farm1)
   changed: (x farm0) from 268 to 267, (x farm1) from 33 to 34
   goals met: 2 of 3
34. (move-slow farm0 farm1)
   changed: (x farm0) from 267 to 266, (x farm1) from 34 to 35
   goals met: 2 of 3
35. (move-slow farm0 farm1)
   changed: (x farm0) from 266 to 265, (x farm1) from 35 to 36
   goals met: 2 of 3
36. (move-slow farm0 farm1)
   changed: (x farm0) from 265 to 264, (x farm1) from 36 to 37
   goals met: 2 of 3
37. (move-slow farm0 farm1)
   changed: (x farm0) from 264 to 263, (x farm1) from 37 to 38
   goals met: 2 of 3
38. (move-slow farm0 farm1)
   changed: (x farm0) from 263 to 262, (x farm1) from 38 to 39
   goals met: 2 of 3
39. (move-slow farm0 farm1)
   changed: (x farm0) from 262 to 261, (x farm1) from 39 to 40
   goals met: 2 of 3
40. (move-slow farm0 farm1)
   changed: (x farm0) from 261 to 260, (x farm1) from 40 to 41
   goals met: 2 of 3
41. (move-slow farm0 farm1)
   changed: (x farm0) from 260 to 259, (x farm1) from 41 to 42
   goals met: 2 of 3
42. (move-slow farm0 farm1)
   changed: (x farm0) from 259 to 258, (x farm1) from 42 to 43
   goals met: 2 of 3
43. (move-slow farm0 farm1)
   changed: (x farm0) from 258 to 257, (x farm1) from 43 to 44
   goals met: 2 of 3
44. (move-slow farm0 farm1)
   changed: (x farm0) from 257 to 256, (x farm1) from 44 to 45
   goals met: 2 of 3
45. (move-slow farm0 farm1)
   changed: (x farm0) from 256 to 255, (x farm1) from 45 to 46
   goals met: 2 of 3
46. (move-slow farm0 farm1)
   changed: (x farm0) from 255 to 254, (x farm1) from 46 to 47
   goals met: 2 of 3
47. (move-slow farm0 farm1)
   changed: (x farm0) from 254 to 253, (x farm1) from 47 to 48
   goals met: 2 of 3
48. (move-slow farm0 farm1)
   changed: (x farm0) from 253 to 252, (x farm1) from 48 to 49
   goals met: 2 of 3
49. (move-slow farm0 farm1)
   changed: (x farm0) from 252 to 251, (x farm1) from 49 to 50
   goals met: 2 of 3
50. (move-slow farm0 farm1)
   changed: (x farm0) from 251 to 250, (x farm1) from 50 to 51
   goals met: 2 of 3
51. (move-slow farm0 farm1)
   changed: (x farm0) from 250 to 249, (x farm1) from 51 to 52
   goals met: 2 of 3
52. (move-slow farm0 farm1)
   changed: (x farm0) from 249 to 248, (x farm1) from 52 to 53
   goals met: 2 of 3
53. (move-slow farm0 farm1)
   changed: (x farm0) from 248 to 247, (x farm1) from 53 to 54
   goals met: 2 of 3
54. (move-slow farm0 farm1)
   changed: (x farm0) from 247 to 246, (x farm1) from 54 to 55
   goals met: 2 of 3
55. (move-slow farm0 farm1)
   changed: (x farm0) from 246 to 245, (x farm1) from 55 to 56
   goals met: 2 of 3
56. (move-slow farm0 farm1)
   changed: (x farm0) from 245 to 244, (x farm1) from 56 to 57
   goals met: 2 of 3
57. (move-slow farm0 farm1)
   changed: (x farm0) from 244 to 243, (x farm1) from 57 to 58
   goals met: 2 of 3
58. (move-slow farm0 farm1)
   changed: (x farm0) from 243 to 242, (x farm1) from 58 to 59
   goals met: 2 of 3
59. (move-slow farm0 farm1)
   changed: (x farm0) from 242 to 241, (x farm1) from 59 to 60
   goals met: 2 of 3
60. (move-slow farm0 farm1)
   changed: (x farm0) from 241 to 240, (x farm1) from 60 to 61
   goals met: 2 of 3
61. (move-slow farm0 farm1)
   changed: (x farm0) from 240 to 239, (x farm1) from 61 to 62
   goals met: 2 of 3
62. (move-slow farm0 farm1)
   changed: (x farm0) from 239 to 238, (x farm1) from 62 to 63
   goals met: 2 of 3
63. (move-slow farm0 farm1)
   changed: (x farm0) from 238 to 237, (x farm1) from 63 to 64
   goals met: 2 of 3
64. (move-slow farm0 farm1)
   changed: (x farm0) from 237 to 236, (x farm1) from 64 to 65
   goals met: 2 of 3
65. (move-slow farm0 farm1)
   changed: (x farm0) from 236 to 235, (x farm1) from 65 to 66
   goals met: 2 of 3
66. (move-slow farm0 farm1)
   changed: (x farm0) from 235 to 234, (x farm1) from 66 to 67
   goals met: 2 of 3
67. (move-slow farm0 farm1)
   changed: (x farm0) from 234 to 233, (x farm1) from 67 to 68
   goals met: 2 of 3
68. (move-slow farm0 farm1)
   changed: (x farm0) from 233 to 232, (x farm1) from 68 to 69
   goals met: 2 of 3
69. (move-slow farm0 farm1)
   changed: (x farm0) from 232 to 231, (x farm1) from 69 to 70
   goals met: 2 of 3
70. (move-slow farm0 farm1)
   changed: (x farm0) from 231 to 230, (x farm1) from 70 to 71
   goals met: 2 of 3
71. (move-slow farm0 farm1)
   changed: (x farm0) from 230 to 229, (x farm1) from 71 to 72
   goals met: 2 of 3
72. (move-slow farm0 farm1)
   changed: (x farm0) from 229 to 228, (x farm1) from 72 to 73
   goals met: 2 of 3
73. (move-slow farm0 farm1)
   changed: (x farm0) from 228 to 227, (x farm1) from 73 to 74
   goals met: 2 of 3
74. (move-slow farm0 farm1)
   changed: (x farm0) from 227 to 226, (x farm1) from 74 to 75
   goals met: 2 of 3
75. (move-slow farm0 farm1)
   changed: (x farm0) from 226 to 225, (x farm1) from 75 to 76
   goals met: 2 of 3
76. (move-slow farm0 farm1)
   changed: (x farm0) from 225 to 224, (x farm1) from 76 to 77
   goals met: 2 of 3
77. (move-slow farm0 farm1)
   changed: (x farm0) from 224 to 223, (x farm1) from 77 to 78
   goals met: 2 of 3
78. (move-slow farm0 farm1)
   changed: (x farm0) from 223 to 222, (x farm1) from 78 to 79
   goals met: 2 of 3
79. (move-slow farm0 farm1)
   changed: (x farm0) from 222 to 221, (x farm1) from 79 to 80
   goals met: 2 of 3
80. (move-slow farm0 farm1)
   changed: (x farm0) from 221 to 220, (x farm1) from 80 to 81
   goals met: 2 of 3
81. (move-slow farm0 farm1)
   changed: (x farm0) from 220 to 219, (x farm1) from 81 to 82
   goals met: 2 of 3
82. (move-slow farm0 farm1)
   changed: (x farm0) from 219 to 218, (x farm1) from 82 to 83
   goals met: 2 of 3
83. (move-slow farm0 farm1)
   changed: (x farm0) from 218 to 217, (x farm1) from 83 to 84
   goals met: 2 of 3
84. (move-slow farm0 farm1)
   changed: (x farm0) from 217 to 216, (x farm1) from 84 to 85
   goals met: 2 of 3
85. (move-slow farm0 farm1)
   changed: (x farm0) from 216 to 215, (x farm1) from 85 to 86
   goals met: 2 of 3
86. (move-slow farm0 farm1)
   changed: (x farm0) from 215 to 214, (x farm1) from 86 to 87
   goals met: 2 of 3
87. (move-slow farm0 farm1)
   changed: (x farm0) from 214 to 213, (x farm1) from 87 to 88
   goals met: 2 of 3
88. (move-slow farm0 farm1)
   changed: (x farm0) from 213 to 212, (x farm1) from 88 to 89
   goals met: 2 of 3
89. (move-slow farm0 farm1)
   changed: (x farm0) from 212 to 211, (x farm1) from 89 to 90
   goals met: 2 of 3
90. (move-slow farm0 farm1)
   changed: (x farm0) from 211 to 210, (x farm1) from 90 to 91
   goals met: 2 of 3
91. (move-slow farm0 farm1)
   changed: (x farm0) from 210 to 209, (x farm1) from 91 to 92
   goals met: 2 of 3
92. (move-slow farm0 farm1)
   changed: (x farm0) from 209 to 208, (x farm1) from 92 to 93
   goals met: 2 of 3
93. (move-slow farm0 farm1)
   changed: (x farm0) from 208 to 207, (x farm1) from 93 to 94
   goals met: 2 of 3
94. (move-slow farm0 farm1)
   changed: (x farm0) from 207 to 206, (x farm1) from 94 to 95
   goals met: 2 of 3
95. (move-slow farm0 farm1)
   changed: (x farm0) from 206 to 205, (x farm1) from 95 to 96
   goals met: 2 of 3
96. (move-slow farm0 farm1)
   changed: (x farm0) from 205 to 204, (x farm1) from 96 to 97
   goals met: 2 of 3
97. (move-slow farm0 farm1)
   changed: (x farm0) from 204 to 203, (x farm1) from 97 to 98
   goals met: 2 of 3
98. (move-slow farm0 farm1)
   changed: (x farm0) from 203 to 202, (x farm1) from 98 to 99
   goals met: 2 of 3
99. (move-slow farm0 farm1)
   changed: (x farm0) from 202 to 201, (x farm1) from 99 to 100
   goals met: 2 of 3
100. (move-slow farm0 farm1)
   changed: (x farm0) from 201 to 200, (x farm1) from 100 to 101
   goals met: 2 of 3
101. (move-slow farm0 farm1)
   changed: (x farm0) from 200 to 199, (x farm1) from 101 to 102
   goals met: 2 of 3
102. (move-slow farm0 farm1)
   changed: (x farm0) from 199 to 198, (x farm1) from 102 to 103
   goals met: 2 of 3
103. (move-slow farm0 farm1)
   changed: (x farm0) from 198 to 197, (x farm1) from 103 to 104
   goals met: 2 of 3
104. (move-slow farm0 farm1)
   changed: (x farm0) from 197 to 196, (x farm1) from 104 to 105
   goals met: 2 of 3
105. (move-slow farm0 farm1)
   changed: (x farm0) from 196 to 195, (x farm1) from 105 to 106
   goals met: 2 of 3
106. (move-slow farm0 farm1)
   changed: (x farm0) from 195 to 194, (x farm1) from 106 to 107
   goals met: 2 of 3
107. (move-slow farm0 farm1)
   changed: (x farm0) from 194 to 193, (x farm1) from 107 to 108
   goals met: 2 of 3
108. (move-slow farm0 farm1)
   changed: (x farm0) from 193 to 192, (x farm1) from 108 to 109
   goals met: 2 of 3
109. (move-slow farm0 farm1)
   changed: (x farm0) from 192 to 191, (x farm1) from 109 to 110
   goals met: 2 of 3
110. (move-slow farm0 farm1)
   changed: (x farm0) from 191 to 190, (x farm1) from 110 to 111
   goals met: 2 of 3
111. (move-slow farm0 farm1)
   changed: (x farm0) from 190 to 189, (x farm1) from 111 to 112
   goals met: 2 of 3
112. (move-slow farm0 farm1)
   changed: (x farm0) from 189 to 188, (x farm1) from 112 to 113
   goals met: 2 of 3
113. (move-slow farm0 farm1)
   changed: (x farm0) from 188 to 187, (x farm1) from 113 to 114
   goals met: 2 of 3
114. (move-slow farm0 farm1)
   changed: (x farm0) from 187 to 186, (x farm1) from 114 to 115
   goals met: 2 of 3
115. (move-slow farm0 farm1)
   changed: (x farm0) from 186 to 185, (x farm1) from 115 to 116
   goals met: 2 of 3
116. (move-slow farm0 farm1)
   changed: (x farm0) from 185 to 184, (x farm1) from 116 to 117
   goals met: 2 of 3
117. (move-slow farm0 farm1)
   changed: (x farm0) from 184 to 183, (x farm1) from 117 to 118
   goals met: 2 of 3
118. (move-slow farm0 farm1)
   changed: (x farm0) from 183 to 182, (x farm1) from 118 to 119
   goals met: 2 of 3
119. (move-slow farm0 farm1)
   changed: (x farm0) from 182 to 181, (x farm1) from 119 to 120
   goals met: 2 of 3
120. (move-slow farm0 farm1)
   changed: (x farm0) from 181 to 180, (x farm1) from 120 to 121
   goals met: 2 of 3
121. (move-slow farm0 farm1)
   changed: (x farm0) from 180 to 179, (x farm1) from 121 to 122
   goals met: 2 of 3
122. (move-slow farm0 farm1)
   changed: (x farm0) from 179 to 178, (x farm1) from 122 to 123
   goals met: 2 of 3
123. (move-slow farm0 farm1)
   changed: (x farm0) from 178 to 177, (x farm1) from 123 to 124
   goals met: 2 of 3
124. (move-slow farm0 farm1)
   changed: (x farm0) from 177 to 176, (x farm1) from 124 to 125
   goals met: 2 of 3
125. (move-slow farm0 farm1)
   changed: (x farm0) from 176 to 175, (x farm1) from 125 to 126
   goals met: 2 of 3
126. (move-slow farm0 farm1)
   changed: (x farm0) from 175 to 174, (x farm1) from 126 to 127
   goals met: 2 of 3
127. (move-slow farm0 farm1)
   changed: (x farm0) from 174 to 173, (x farm1) from 127 to 128
   goals met: 2 of 3
128. (move-slow farm0 farm1)
   changed: (x farm0) from 173 to 172, (x farm1) from 128 to 129
   goals met: 2 of 3
129. (move-slow farm0 farm1)
   changed: (x farm0) from 172 to 171, (x farm1) from 129 to 130
   goals met: 2 of 3
130. (move-slow farm0 farm1)
   changed: (x farm0) from 171 to 170, (x farm1) from 130 to 131
   goals met: 2 of 3
131. (move-slow farm0 farm1)
   changed: (x farm0) from 170 to 169, (x farm1) from 131 to 132
   goals met: 2 of 3
132. (move-slow farm0 farm1)
   changed: (x farm0) from 169 to 168, (x farm1) from 132 to 133
   goals met: 2 of 3
133. (move-slow farm0 farm1)
   changed: (x farm0) from 168 to 167, (x farm1) from 133 to 134
   goals met: 2 of 3
134. (move-slow farm0 farm1)
   changed: (x farm0) from 167 to 166, (x farm1) from 134 to 135
   goals met: 2 of 3
135. (move-slow farm0 farm1)
   changed: (x farm0) from 166 to 165, (x farm1) from 135 to 136
   goals met: 2 of 3
136. (move-slow farm0 farm1)
   changed: (x farm0) from 165 to 164, (x farm1) from 136 to 137
   goals met: 2 of 3
137. (move-slow farm0 farm1)
   changed: (x farm0) from 164 to 163, (x farm1) from 137 to 138
   goals met: 2 of 3
138. (move-slow farm0 farm1)
   changed: (x farm0) from 163 to 162, (x farm1) from 138 to 139
   goals met: 2 of 3
139. (move-slow farm0 farm1)
   changed: (x farm0) from 162 to 161, (x farm1) from 139 to 140
   goals met: 2 of 3
140. (move-slow farm0 farm1)
   changed: (x farm0) from 161 to 160, (x farm1) from 140 to 141
   goals met: 2 of 3
141. (move-slow farm0 farm1)
   changed: (x farm0) from 160 to 159, (x farm1) from 141 to 142
   goals met: 2 of 3
142. (move-slow farm0 farm1)
   changed: (x farm0) from 159 to 158, (x farm1) from 142 to 143
   goals met: 2 of 3
143. (move-slow farm0 farm1)
   changed: (x farm0) from 158 to 157, (x farm1) from 143 to 144
   goals met: 2 of 3
144. (move-slow farm0 farm1)
   changed: (x farm0) from 157 to 156, (x farm1) from 144 to 145
   goals met: 2 of 3
145. (move-slow farm0 farm1)
   changed: (x farm0) from 156 to 155, (x farm1) from 145 to 146
   goals met: 2 of 3
146. (move-slow farm0 farm1)
   changed: (x farm0) from 155 to 154, (x farm1) from 146 to 147
   goals met: 2 of 3
147. (move-slow farm0 farm1)
   changed: (x farm0) from 154 to 153, (x farm1) from 147 to 148
   goals met: 2 of 3
148. (move-slow farm0 farm1)
   changed: (x farm0) from 153 to 152, (x farm1) from 148 to 149
   goals met: 2 of 3
149. (move-slow farm0 farm1)
   changed: (x farm0) from 152 to 151, (x farm1) from 149 to 150
   goals met: 2 of 3
150. (move-slow farm0 farm1)
   changed: (x farm0) from 151 to 150, (x farm1) from 150 to 151
   goals met: 2 of 3
151. (move-slow farm0 farm1)
   changed: (x farm0) from 150 to 149, (x farm1) from 151 to 152
   goals met: 2 of 3
152. (move-slow farm0 farm1)
   changed: (x farm0) from 149 to 148, (x farm1) from 152 to 153
   goals met: 2 of 3
153. (move-slow farm0 farm1)
   changed: (x farm0) from 148 to 147, (x farm1) from 153 to 154
   goals met: 2 of 3
154. (move-slow farm0 farm1)
   changed: (x farm0) from 147 to 146, (x farm1) from 154 to 155
   goals met: 2 of 3
155. (move-slow farm0 farm1)
   changed: (x farm0) from 146 to 145, (x farm1) from 155 to 156
   goals met: 2 of 3
156. (move-slow farm0 farm1)
   changed: (x farm0) from 145 to 144, (x farm1) from 156 to 157
   goals met: 2 of 3
157. (move-slow farm0 farm1)
   changed: (x farm0) from 144 to 143, (x farm1) from 157 to 158
   goals met: 2 of 3
158. (move-slow farm0 farm1)
   changed: (x farm0) from 143 to 142, (x farm1) from 158 to 159
   goals met: 2 of 3
159. (move-slow farm0 farm1)
   changed: (x farm0) from 142 to 141, (x farm1) from 159 to 160
   goals met: 2 of 3
160. (move-slow farm0 farm1)
   changed: (x farm0) from 141 to 140, (x farm1) from 160 to 161
   goals met: 2 of 3
161. (move-slow farm0 farm1)
   changed: (x farm0) from 140 to 139, (x farm1) from 161 to 162
   goals met: 2 of 3
162. (move-slow farm0 farm1)
   changed: (x farm0) from 139 to 138, (x farm1) from 162 to 163
   goals met: 2 of 3
163. (move-slow farm0 farm1)
   changed: (x farm0) from 138 to 137, (x farm1) from 163 to 164
   goals met: 2 of 3
164. (move-slow farm0 farm1)
   changed: (x farm0) from 137 to 136, (x farm1) from 164 to 165
   goals met: 2 of 3
165. (move-slow farm0 farm1)
   changed: (x farm0) from 136 to 135, (x farm1) from 165 to 166
   goals met: 2 of 3
166. (move-slow farm0 farm1)
   changed: (x farm0) from 135 to 134, (x farm1) from 166 to 167
   goals met: 2 of 3
167. (move-slow farm0 farm1)
   changed: (x farm0) from 134 to 133, (x farm1) from 167 to 168
   goals met: 2 of 3
168. (move-slow farm0 farm1)
   changed: (x farm0) from 133 to 132, (x farm1) from 168 to 169
   goals met: 2 of 3
169. (move-slow farm0 farm1)
   changed: (x farm0) from 132 to 131, (x farm1) from 169 to 170
   goals met: 3 of 3
